-- phpMyAdmin SQL Dump
-- version 4.4.14.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2016-11-26 18:13:33
-- 服务器版本： 5.6.23-log
-- PHP Version: 5.5.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `xfd`
--

-- --------------------------------------------------------

--
-- 表的结构 `jiandati`
--

CREATE TABLE IF NOT EXISTS `jiandati` (
  `tihao` int(10) NOT NULL,
  `timu` varchar(1000) NOT NULL,
  `daan` varchar(1000) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=19 DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `jiandati`
--

INSERT INTO `jiandati` (`tihao`, `timu`, `daan`) VALUES
(1, '2006年10月在北京召开了中国共产党第十六届中央委员会第六次会议，会议认为，\r\n构建社会主义和谐社会，是我们党从中国特色社会主义事业的总体布局和全面建设小康社\r\n会的全局出发提出的重大战略任务，反映了建设富强民主文明和谐的社会主义现代化国家\r\n的内在要求，体现了全党全国各族人民的共同愿望。根据材料简单说说社会主义和谐社会的主要环节是什么?怎样提高构建社会主义和谐社会的能力？', '①维护和实现公平和正义是构建社会主义和谐社会的主要环节。②(一)全面贯彻尊重劳动、尊重知识、尊重人才、尊重创造的方针，不断增强全社会的创造活力。（二）\r\n妥善协调各方面的利益关系，正确处理人民内部矛盾。（三）加强社会建设和管理，推进社会管理体制创新。(四)健全工作机制，维护社会稳定。(五)坚持党的群众路线，加强和改进新形势下的群众工作。'),
(2, '“入党特别是思想上入党，将伴随一个党员政治生命的全过程，是共产党员永恒的必修课，是共产党员党性锻炼的核心内容和长期任务”。“一个人在组织上入党，只是自己作为党员政治生活的开始，要真正从思想上完全入党，则是共产党员长时期的、须臾不可忘记的政治任务”——《优秀大学生党性修养论》。根据材料谈谈作为党员发展对象，思想上入党的重要性。', '一是坚持从思想上入党是坚持党性和党的宗旨的要求；二是坚持从思想上入党是巩固党的执政地位的重要保证；三是坚持从思想上入党是我们党的优良传统和宝贵经验；四是坚持从思想上入党是全面贯彻党的基本路线的内在要求。作为党员发展对象，如果在组织上入了党，但在思想上还没有入党，或者说没有完全入党，党性不纯，就会在许多方面与新形势、新任务的要求不相适应，就会出现一些违背党的先进性要求和违背人民群众利益的问题，这就违背了党的宗旨，玷污了共产党员的光荣称号。'),
(3, '党的十八届三中全会通过的《中共中央关于全面深化改革若干重大问题的决定》强调落\r\n实“税收法定原则”，2015年3月，十二届全国人大三次会议表决通过新修订的《中华人民共和国立法法》，明确“税种的设立，税率的确定和税收征收管理等税收基本制度”只能由法律规定。请简要说明我国为什么要坚持税收法定原则。', '①中国共产党是中国特色社会主义事业的领导核心，在我国社会主义事业中发挥中\r\n积极作用。②中国共产党坚持民主执政、依法执政、科学执政。③人民代表大会制度是我国\r\n的根本政治制度，全国人民代表大会具有最高立法权。'),
(4, '以“为民务实清廉”为主要内容的党的群众路线教育实践活动启动以来，某市市委高度重视，要求把开展教育实践活动作为重大政治任务，严格贯彻落实中央和省委的部署要求，精心组织、统筹安排，确保活动取得成效。为认真做好全市党的群众路线教育实践活动的前期准备工作，该市市委将“作风建设年”活动有机融入其中，坚持领导示范、超前谋划、统筹推进，为实现教育实践活动高标准起步、高起点开局奠定了坚实基础。同时，各级领导干部率先垂范，带头转变作风，深入基层、深入群众，听民声、访民情、解民难，进一步密切党群干群关系；坚持边查边改、边整边改，把解决问题贯穿活动全过程，干部作风存在的突出问题得到了有效解决。“作风建设年”活动的有效开展，为开展党的群众路线教育实践活动提前预热、先行先试，奠定了扎实的思想基础、工作基础和制度基础。根据材料分析党的群众路线教育实践活动取得成效的原因。', '①开展党的群众路线教育实践活动，严格贯彻落实中央和省委的部署要求，精心组织、统筹安排，发挥了先进社会意识对社会发展的积极推动作用。②将“作风建设年”活动有机融入其中，坚持领导示范、超前谋划、统筹推进，发挥了正确价值观对人们行为的重要驱动和导向作用。③深入基层、深入群众，听民声、访民情、解民难，进一步密切党群干群关系，坚持了党的群众观点和群众路线。④有效开展“作风建设年”活动，为开展党的群众路线教育实践活动提前预热、先行先试，遵循了客观事物发展的规律；深入基层、深入群众，听民声、访民情、解民难，坚持边查边改、边整边改，把解决问题贯穿活动全过程，做到了自觉站在最广大人民的立场上，必然得到人民群众的支持和拥护。'),
(5, '中共中央印发《建立健全惩治和预防腐败体系2013-2017年工作规划》，提出加强廉政文化建设要深入开展中国特色社会主义和中国梦教育、理想信念和宗旨教育、社会主义核心价值体系教育。积极借鉴中外历史上优秀廉政文化，把培育廉洁价值理念融入国民教育、精神文明建设和法制教育之中。发挥文化馆、纪念馆和廉政教育基地等的作用，加强廉政文化精品工程建设，开展廉政文化创建活动，扬真抑假、扬善抑恶、扬美抑丑，培育良好的民风社风。\r\n根据材料谈谈你对中共中央加强廉政文化建设要求的理解。', '①社会主义核心价值体系是社会主义意识形态的本质体现，是全国各族人民团结奋斗的共同思想道德基础。用社会主义核心价值体系凝魂聚气、强基固本，引领社会思潮、凝聚社会共识，增强社会主义意识形态的吸引力和凝聚力。\r\n③惩治和预防腐败需要立足实践，既要继承传统的优秀廉政文化，又要与时俱进，推陈出新；还要博采众长，积极借鉴国外优秀廉政文化成果。\r\n④文化对人的影响离不开特定的文化环境和丰富多样的文化活动，把培育廉洁价值理念融入国民教育、精神文明建设和法制教育的活动之中，会对人们产生潜移默化和深远持久的影响。'),
(6, '上班“淘宝”、炒股、打牌，午休时间和朋友小酌几杯，端午发串粽子、中秋发盒月饼……这些曾被认为是司空见惯的“小事”，如今却成为广大干部严守底线的“行为禁区”，甚至可能会因此被中纪委官网点名曝光。自中央八项规定六项禁令施行以来，官网已通报批评了上千起违反中央八项规定精神的典型案例，不少干部慨叹，“官不好当了”。有的抱着“只要不出事、宁愿不做事”的心态，不收礼不吃请了，但该做的事也不做了；有的以差旅费报销太严为由，该出差的不出了，该下乡的不下了；甚至有的离开宴请吃喝，就不知道该怎么工作了。不贪不占，但也不干事了。一些人觉得“当官没劲了”。\r\n有网友评论：“当干部不容易，事业才会有希望；当干部不舒服，老百姓才会更舒服。”\r\n根据材料分析网友观点的合理性。', '①我国是人民民主专政的社会主义国家，我国政府是为人民服务的政府，政府及其工作人员只有贯彻为人民服务的宗旨，坚持对人民负责的原则，做好本职工作，才能更好地服务于群众，“让老百姓更舒服”。②管理与服务是政府的基本职能，坚持“法定职责必须为”，克服懒政、怠政，我们的“事业才会有希望”。'),
(7, '2014年党的群众路线教育实践活动第二批部署会议在北京召开，会议强调，要充分运用第一批活动经验，紧紧扭住反对“四风"，从群众最关心、最迫切的问题入手，着力解决关系群众切身利益的问题，解决群众身边的不正之风问题，把改进作风成效落实到基层，真正让群众受益，努力取得人民群众满意的实效。这一活动对夯实党的执政基础，巩固党的执政地位，具有十分重大而深远的意义。\r\n根据材料阐释开展党的群众路线教育实践活动对巩固党的执政地位的意义。', '①开展党的群众路线教育实践活动，改进“四风”有利于增强党为人民服务的宗旨意识，保持党的先进性和纯洁性，巩固党的执政地位。\r\n②开展党的群众路线教育实践活动，改进“四风”有利于党坚持科学执政、民主执政、依法执政，提高党的执政能力和执政水平，巩固党的执政地位。\r\n③开展党的群众路线教育实践活动，从群众最关心、最迫切的问题入手，解决群众身边的不正之风问题，有利于密切党同群众的血肉联系，做到以人为本，执政为民，巩固党的执政地\r\n位。'),
(8, '【中国梦与个人梦】\r\n中国梦一直以来都是全国各族人民的共同理想，正如习近平同志所强调的，“只有每个人都为美好梦想而奋斗，才能汇聚起实现中国梦的磅礴力量”，“中国梦归根到底是人民的梦，必须紧紧依靠人民来实现，必须不断为人民造福”，这也必然决定了当下中国实现中国梦，必须以人民利益为最高准绳，把最广大人民群众的切身利益实现好、维护好、发展好，把中国梦落实到老百姓的幸福生活上，落实到解决老百姓关心的一件一件具体事情上。\r\n根据材料分析为什么“只有每个人都为美好梦想而奋斗，才能汇聚起实现中周梦的磅礴力量”。', '①人民群众是社会变革的决定力量，在任何时期都是社会变革的主力军。因此只有每个人都为美好梦想而奋斗，才可能赢得改革胜利。②人民群众通过推动生 产力发展而不断创造和改变社会关系，从而不断推动社会历史进步和发展。因此只有每个人都为美好梦想而奋斗，创造新的社会关系，才能聚起实现中国梦的磅礴力量。'),
(9, '为在S县凝聚实现中国梦的强大力量，2014年以来，S县党委创新开展了以“五到?‘五带头”活动为主要内容的党的群众路线教育实践活动。即县级党员领导干部到群众中去、到基层去、到工作的第一线去、到项目建设的主战场去、到问题多的地方去；始终做到带头“心贴心”与群众交流，带头“实打实”帮助基层群众解决问题，带头“硬碰硬”发动群众抓好、解决好重点难点工作，带头“面对面”调解矛盾纠纷，带头“背靠背”听取意见，赢得了群众的拥护和支持。\r\n根据材料分析S县党委开展“五到一五带头”活动为主要内容的党的群众路线教育实践活动的原因。', '①中国共产党是执政党，是各项事业的领导核心。故S县党委要做到“五到”“五带头”。②中国共产党应始终代表先进生产力的发展要求。故S县党员领导干部要到工作一线、基层、项目建设主战场去，以推动生产力发展。③中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，全心全意为人民服务是党的宗旨，坚持从群众中来到群众中去是党的工作方法，这决定了党应“始终做到带头‘心贴心’与群众交流”，帮助基层群众解决问题。'),
(10, '面对世情、国情、党情的深刻变化，精神懈怠危险、能力不足危险、脱离群众危险、消极腐败危险更加尖锐地摆在全党面前，党内脱离群众的现象大量存在，集中表现在形式主义、官僚主义、享乐主义和奢靡之风这“四风”上。因此，我们要围绕保持党的先进性和纯洁性，在全党深入开展以为民务实清廉为主要内容的党的群众路线教育实践活动，对作风之弊、行为之垢来一次大排查、大检修、大扫除。\r\n根据材料分析说明开展党的群众路线教育实践活动的必要性。', '①文化对人的影响来自于特定的文化环境和各种形式的文化活动，文化对人的影响是潜移默化、深远持久的。通过党的群众路线教育实践活动，能让党员干部自觉树立正确的世界观、人生观、价值观。②文化影响人的实践活动、认识活动和思维方式。推进作风建设有利于党员干部增强群众观念，坚持群众路线，保持良好的党风、政风乃至优化整个社会风气。③优秀文化能丰富人的精神世界，增强人的精神力量。开展党的群众路线教育实践活动，能促进党员干部全面发展。'),
(11, '2014年党的群众路线教育实践活动第二批部署会议在北京召开，会议强调，要充分运\r\n用第一批活动经验，紧紧扭住反对“四风"，从群众最关心、最迫切的问题入手，着力解决\r\n关系群众切身利益的问题，解决群众身边的不正之风问题，把改进作风成效落实到基层，真正让群众受益，努力取得人民群众满意的实效。这一活动对夯实党的执政基础，巩固党的执\r\n政地位，具有十分重大而深远的意义。\r\n根据材料阐释开展党的群众路线教育实践活动对巩固党的执政地位的意义。', '①开展党的群众路线教育实践活动，改进“四风”有利于增强党为人民服务的宗旨意识，保持党的先进性和纯洁性，巩固党的执政地位。\r\n②开展党的群众路线教育实践活动，改进“四风”有利于党坚持科学执政、民主执政、依法\r\n执政，提高党的执政能力和执政水平，巩固党的执政地位。\r\n③开展党的群众路线教育实践活动，从群众最关心、最迫切的问题入手，解决群众身边的不正之风问题，有利于密切党同群众的血肉联系，做到以人为本，执政为民、巩固党的执政地位。'),
(12, '中国共产党十八届四中全会审议通过了《中共中央关于全面推进依法治国若干重大问题的决定》。全会提出，全面推进依法治国，总目标是建设中国特色社会主义法治体系，建设社会主义法治国家。这就是，在中国共产党领导下，坚持中国特色社会主义制度，贯彻中国特色社会主义法治理论，形成完备的法律规范体系、高效的法治实施体系、严密的法治监督体系、有力的法治保障体系，形成完善的党内法规体系，坚持依法治国、依法执政、依法行政共同推进，坚持法治国家、法治政府、法治社会一体建设，实现科学立法、严格执法、公正司法、全民守法，促进国家治理体系和治理能力现代化。\r\n\r\n根据材料说明我们怎样为实现建设中国特色社会主义法治体系，建设社会主义法治国家的总目标发挥作用。', '①必须坚持中国共产党的领导，坚持人民主体地位，坚持法律面前人人平等，坚持依法治国和以德治国相结合，坚持从中国实际出发。②全国人大及其常委会作为我国的立法机关，应加强立法工作，科学民主立法，完善社会主义法律体系，发挥立法的引领和推动作用。同时，完善全国人大及其常委会宪法监督制度，保证宪法和法律的实施。③行政机关要深入推进依法行政，建设法治政府，这是贯彻依法治国方略，提高行政管理水平的基本要求。'),
(13, '由于种种原因特别是传统的封建“人治”思想的影响，我们党在治国方略的选择上经历过一些曲折。党的十一届三中全会总结“文化大革命”中法制被严重破坏的惨痛教训，清醒地认识到加强法制的重要性和紧迫性，提出了发展社会主义民主，健全社会主义法制的战略方针。随着改革开放和社会主义民主法制建设的推进，特别是社会主义市场经济体制的确立，1997年，党的十五大最终确立了依法治国，建设社会主义法治国家的基本方略，完成了我们党执政治国理念的一次深刻而重大的转变。面对全面建成小康社会、全面深化改革的任务要求，2014年十八届四中全会首次提出建设社会主义法治体系的目标，从法律体系向法治体系的迈进，标志着我们党治国理政理念的又一次重大飞跃和治国理政方式的重大转变。国际社会认为中国共产党全面推进依法治国将使中国实现可持续发展，使中国老百姓从中受益，中国未来的发展也将更加健康有序。\r\n根据材料谈谈你对我党治国理政理念不断转变的认识。', '①客观事物是不断变化发展的，认识也要不断发展。我党治国理政理念的不断转变正是随着我国社会主义现代化建设事业的不断发展而发展的。②实践是认识的基础。实践是认识的来源，是认识发展的动力，是检验认识的标准。我国不同历史时期的社会主义现代化建设的实践需要，推动我们党依法治国理念的一次次的飞跃与发展。③认识对实践具有反作用，正确的认识指导实践会促进事物的发展。我们党依法治国理念的不断发展和提高，将有利于促进我国未来的健康有序发展，使老百姓受益。④认识具有反复性、无限性和上升性。我们党对依法治国理念的认识是逐步深化和发展的。'),
(14, '实现民族复兴，是中华民族近代以来的伟大的梦想。无数仁人志士苦苦探索民族复兴的\r\n道路，然而一次又一次地失败了。自中国共产党成立以来，团结带领全国人民经历长期的\r\n艰苦斗争，求得民族独立，建立新中国。\r\n新中国成立以来特别是改革开放以来，党带领人民艰苦创业，不断夺取中国特色社会主义\r\n新胜利。现在，我国政权稳定、社会和谐，全国人民团结一心实现中华民族的伟大复兴。\r\n为此，习近平总书记号召全党同志承前启后、继往开来，继续朝着民族复兴的目标前行。\r\n党历来重视青年工作，为他们的成长、成才提供了广阔的舞台。青年也通过努力学习和实践，在党领导的民族复兴征程中奉献自己的聪明才智。\r\n根据材料分析说明上述材料。', '上述材料表明，党领导人民实现民族独立并朝着民族复兴的目标前进，这体现了中国共产\r\n党是我们事业的领导核心。\r\n党团结带领全国人民艰苦奋斗，实现民族独立，建立新中国，表明党的领导地位是历史和\r\n人民的选择。\r\n全国人民团结一心实现民族复兴，党号召并团结凝聚全国人民朝着民族复兴的目标继续前\r\n进，表明党的领导是中国发展和进步的客观要求。\r\n为实现党领导的民族复兴事业，青年奉献自己的聪明才智，表明青年自觉拥护党的领导。\r\n党领导的民族复兴大业，终将在广大青年的接力奋斗中变为现实。');

-- --------------------------------------------------------

--
-- 表的结构 `tiankongti`
--

CREATE TABLE IF NOT EXISTS `tiankongti` (
  `tihao` int(11) NOT NULL,
  `timu` varchar(500) NOT NULL,
  `daan` varchar(200) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=64 DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `tiankongti`
--

INSERT INTO `tiankongti` (`tihao`, `timu`, `daan`) VALUES
(27, '民主集中制原则之二规定党的各级领导机关，除它们派出的代表机关和非党组织中的党组外，都由______产生。', '参考答案：选举'),
(26, '受到留党察看处分的党员，恢复党的权利____年，不得在党内担任其原职。', '参考答案：两年'),
(25, '在现阶段，我国社会的主要矛盾是_________________矛盾。', '参考答案：人民日益增长的物质文化需要同落后的社会生产之间的'),
(23, '党的全国代表大会每_____年举行一次。', '参考答案：五'),
(24, '中国共产党按照的方针__________，完成祖国统一大业。', '参考答案：一个国家，两种制度'),
(22, '党的领导主要是______。', '参考答案：政治、思想和组织的领导'),
(21, '党组织在接受新党员之前，除了召开各种座谈会或个别征求意见外，还需进行______。', '参考答案：入党前公示'),
(19, '党的支部委员会对申请入党的人，要注意征求______有关群众的意见。', '参考答案：党内党外'),
(20, '党的基层组织要教育党员和群众自觉抵制______，坚决同各种违法犯罪行为作斗争。', '参考答案：不良倾向'),
(18, '申请入党的人，要经过支部大会通过和上级党组织批准，并且经过______，才能成为正式党员。', '参考答案：预备期考察'),
(17, '为完成党在新世纪新阶段的全面建设小康社会的奋斗目标，发展要有新思路，改革要有新突破，______，各项工作要有新举措。', '参考答案：开放要有新局面'),
(15, '增强党员的党性与发展党员的个性之间的关系应是___________。', '参考答案：在党性修养中也能发展党员的个性'),
(16, '民主集中制是民主基础上的集中和集中指导下的民主相结合。它既是党的_____，也是群众路线在党的生活中的运用。', '参考答案：根本组织原则'),
(14, '严重触犯刑律的中央委员、候补中央委员，由______决定开除其党籍。', '参考答案：中央政治局'),
(13, '共青团是广大青年在实践中学习______的学校。', '参考答案：共产主义'),
(12, '应当用党的基本路线和爱国主义、集体主义、集体主义思想教育党员和人民群众，增强______精神。', '参考答案：民族自尊、自信和自强'),
(11, '_______________的主要目的，是为了使党组织对发展对象有一个全面的了解，弄清他们的政治历史、现实表现、政治立场、政治观点和对重大原则问题的政治态度，是发展党员必须履行的手续，是保证新党员质量的重要环节。', '参考答案：政治审查'),
(10, '推进民族区域自治______进程是我国实行民族区域自治的前提和核心。', '参考答案：法制化'),
(9, '______是我们党执政兴国的第一要务。', '参考答案：发展'),
(8, '入党宣誓仪式包括：第一，宣布仪式开始，奏_________；第二，党组织负责人致辞；第三，宣布参加宣誓的新党员名单；第四，宣誓。', '参考答案：《国际歌》'),
(6, '毛泽东深刻阐明革命文艺的根本方向______。', '参考答案：为人民服务'),
(7, '申请入党的人，要填写入党志愿书，要有两名_________作介绍人，要经过支部大会通过和上级党组织批准，并且经过预备期的考察，才能成为正式党员。', '参考答案：正式党员'),
(3, '____________是中国共产党执政的基本方式。', '参考答案：依法执政'),
(4, '在新世纪新阶段，经济和社会发展的战略目标是，巩固和发展____________，到建党一百年时，建成惠及十几亿人口的更高水平的小康社会；到建国一百年时，人均国内生产总值达到中等发达国家水平，基本实现现代化。', '参考答案：已经初步达到的小康水平'),
(5, '中国共产党正在充满信心地带领全国各族人民为实现______、完成祖国统一、维护世界和平与促进共同发展这三大历史任务而努力奋斗！', '参考答案：推进现代化建设'),
(2, '中国共产党以马克思列宁主义、毛泽东思想、邓小平理论和______作为自己的行动指南。', '参考答案：“三个代表”重要思想。'),
(1, '党在______是要把我国建设成为富强、民主、文明的社会主义现代化国家而奋斗。', '参考答案：社会主义初级阶段。'),
(28, '严格履行入党手续，是对申请人的一次政治教育和______。', '参考答案：组织审查');

-- --------------------------------------------------------

--
-- 表的结构 `xuanzeti`
--

CREATE TABLE IF NOT EXISTS `xuanzeti` (
  `tihao` int(10) NOT NULL,
  `timu` varchar(500) NOT NULL,
  `daan` varchar(100) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=43 DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `xuanzeti`
--

INSERT INTO `xuanzeti` (`tihao`, `timu`, `daan`) VALUES
(3, '3.十八届三中全会指出，全面深化改革的重点（）\r\nA.政治体制改革            B.经济体制改革\r\nC.文化体制改革            D.社会体制改革', '参考答案：B'),
(2, '2.______所涉及的问题是全局性、根本性，它关系党的兴衰存亡。\r\n A.党的政治纪律          B.党的组织纪律                 C.党的经济纪律', '参考答案：B'),
(1, '1.__________，集中反映了共产党人的群众观。\r\n A.权为民所用            B.情为民所系                   C.利为民所谋', '参考答案：B'),
(4, '1.共青团中央发出通知，各级团组织要广泛开展(  )引导青少年在实践中牢固树立社会主义荣辱观。\r\n A.读书活动              B.互助活动                     C.道德实践活动', '参考答案：C'),
(5, '2.党要适应改革开放和社会主义现代化建设的要求，加强和改善(  )\r\n A.思想政治工作          B.基层组织建设                 C.党的领导', '参考答案：C'),
(6, '3.________________，是“三个代表”重要思想的核心内容。\r\nA.代表中国最先进文化的前进方向\r\nB.代表中国最广大人民的根本利益\r\nC.代表中国最先进生产力的发展方向', '参考答案：B'),
(7, '1.我国正处于并将长期处于(  )这是在经济文化落后的中国建设社会主义现代化不可逾越的历史阶段，需要上百年的时间。\r\n A.社会主义阶段           B.社会主义初级阶段              C.共产主义阶段', '参考答案：B'),
(8, '2.党章规定什么样的人面向党旗宣誓：(  )\r\n A.申请入党的人          B.预备党员                     C.正式党员', '参考答案：B'),
(9, '3.党的最高理想和最终目标是(  )\r\n A.建设社会主义          B.实现共产主义                 C.实现小康社会', '参考答案：B'),
(10, '1.党的各级代表大会的代表和委员会的产生，要体现选举人的意志。选举采用（ ）的方式。\r\n A.代表表决              B.无记名投票                   C.公开表决', '参考答案：B'),
(11, '2._________________是确保党员质量，提高党员素质的重要条件。\r\n A.党员的义务            B.党员的先进性                  C.党员的组织纪律', '参考答案：A'),
(12, '3.___________是党的先进性在党员个体身上的集中体现。\r\n A.党员的先进性意识      B.党员的思想觉悟                C.党员的模范行为', '参考答案：A'),
(13, '1.我国正处于并将长期处于社会主义初级阶段。这是在经济文化落后的中国建设社会主义现代化不可逾越的历史阶段，需要________________的时间。\r\n A.50年                    B.80年                           C.上百年', '参考答案：B'),
(14, '2.中国共产党在领导社会主义事业中，必须坚持以经济建设为中心，其他各项工作都服从和服务于这个中心。要抓紧时机，加快发展，实施科教兴国战略和______ ，充分发挥科学技术作为第一生产力的作用，依靠科技进步，提高劳动者素质，做到效益好、质量高、速度快，努力把经济建设搞上去。\r\n A.走出去战略               B.可持续发展战略                   C.科技强军战略', '参考答案：B'),
(15, '3.中央政治局常务委员会和中央委员会总书记，由______选举产生。\r\n A.中央委员会全体会议       B.全国代表大会                     C.中央政治局', '参考答案：A'),
(16, '1.作为一名共产党员，必须有比较确定的政治观点和____________，必须有自己的坚定信仰、终身奋斗目标和志向，必须在政治上比较成熟。\r\n A.政治取向              B.政治认识                      C.政治立场', '参考答案：C'),
(17, '2.坚持（ ）的基本原理，是中国人民自愿选择的适合中国国情的道路。\r\n A. 马列主义             B.毛泽东思想                   C.邓小平理论', '参考答案：A'),
(18, '3.党章规定申请加入中国共产党的人必须年满______周岁。\r\n A.20                    B.18                            C.25', '参考答案：B'),
(19, '1.预备期的作用，主要在于对预备党员作进一步的教育和______。\r\n A.引导                     B.考察                             C.锻炼', '参考答案：B'),
(20, '2.发挥____________在资源配置中的基础性作用，建立完善的宏观调控体系。统筹城乡发展、区域发展、经济社会发展、人与自然和谐发展、国内发展和对外开放，调整经济结构，转变经济发展方式。\r\n A.国家                     B.计划                             C.市场', '参考答案：C'),
(21, '3.党的______是党的各级组织和全体党必须遵守的行为规则。\r\n A.组织原则                 B..纪律                             C.章程', '参考答案：B '),
(22, '1.__________________是社会主义民主政治的本质和核心。\r\n A.民主监督              B.人民当家作主                 C.政治协商', '参考答案：B'),
(23, '2.党的思想建设，_______和作风建设是相辅相成的整体。\r\n A.制度建设              B.纪律建设                     C.组织建设', '参考答案：C'),
(24, '3.党的党龄，从______之日算起。\r\n A.支部通过为预备党员    B.上级批准为正式党员           C.预备期满转为正党员', '参考答案：C'),
(25, '1.党员组织关系介绍信是党员政治身份的证明，介绍信的有效期一般不超过（ ）。\r\n A. 一个月               B.三个月                  C.半年', '参考答案：B'),
(26, '2.把经济建设，政治建设，文化建设和_____四位一体的中国特色社会主义事业总体布局写入党章，对于夺取全面建设小康社会新胜利、开创中国特色社会主义事业新局面，具有重大意义。\r\nA.党的建设               B.社会建设                C.政府建设', '参考答案：B'),
(27, '3.民族要自立，国家要强盛，必须大力倡导_____的精神，大力提高全民族的科学文化素质。\r\nA.崇尚科学、反对愚昧\r\nB.诚实守信、反对见利忘义\r\nC.团结互助、反对损人利己', '参考答案：A'),
(28, '1.社会主义必然代替资本主义是______不可逆转的总趋势。\r\nA.革命发展进程               B.社会历史发展                  C.人类进步', '参考答案：A'),
(29, '2.党必须______国家的立法、司法、行政机关，经济、文化组织和人民团体积极主动地、独立负责地、协调一致地工作。\r\nA.适应                       B.领导                          C.保证', '参考答案：B'),
(30, '3.农村党的支部对本区工作实行______。\r\nA.监督                       B.指导                          C.领导', '参考答案：C'),
(31, '1.十一届三中全会以来，实现了全党工作中心向（ ）的转移。\r\n A. 民主建设                  B.法制建设                    C.经济建设', '参考答案：C'),
(32, '2.工人阶级政党的内部监督的特征是_________。\r\nA.严格的强制性\r\nB.高度的自觉性，不需要强制性\r\nC.建立在自觉基础上的强制性', '参考答案：C'),
(33, '3.党章规定，党总支部委员会和支部委员会每届任期（ ）。\r\n A.2年                        B.3年                  C.2年或3年', '参考答案：C'),
(34, '1.民主集中原则之五规定党的各级委员会实行______的制度。\r\nA.集体领导\r\nB.集中统一和民主讨论\r\nC.集体领导和个人分工负责相结合', '参考答案：C'),
(35, '2.中国共产党是中国特色社会主义事业的领导核心，这句话主要说明了_______。\r\nA.党的阶级性和先进性\r\nB.党的根本宗旨\r\nC.党的地位和作用', '参考答案：C'),
(36, '3.党的十八届三中全会提出的改革任务在时间设计上是到（ ）年。\r\n A.2015       B.2020       C.2030        D.2050', '参考答案：B'),
(37, '1.党的干部要坚持实事求是，认真调查研究，能够把党的方针、政策同本地区、本部门的实际相结合，讲实话______，反对形式主义。\r\n A.办实事，求实效           B.多做事少开会             C.确实做出成绩', '参考答案：A'),
(38, '2.中国共产党在建国后，顺利进行了社会主义改造，确立了______制度。\r\n A.社会主义                 B.新民主主义               C.人民民主的', '参考答案：A'),
(39, '3.党员如果没有正当理由，连续（ ）不交纳党费，就被认为是自行脱党。\r\n A.三个月                   B.半年                     C.一年', '参考答案：B'),
(40, '1.党是根据自己的纲领和章程，按照（ ）组织起来的统一整体。\r\n A. 民主法制               B.民主集中制            C.民主分工；', '参考答案：B'),
(41, '2.党的民主集中制的"四个服从"是指：个人服从组织，少数服从多数，______，全党服从中央。   \r\n A.党员服从干部            B.委员会服从代表大会             C.下级服从上级 ', '参考答案：C'),
(42, '3.党员有权要求______不称职的干部。\r\n A.罢免                     B.罢免或撤换                  C.开除', '参考答案：B');

-- --------------------------------------------------------

--
-- 表的结构 `xuanzeti2`
--

CREATE TABLE IF NOT EXISTS `xuanzeti2` (
  `tihao` int(10) NOT NULL,
  `timu` varchar(500) NOT NULL,
  `daan` varchar(200) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

-- --------------------------------------------------------

--
-- 表的结构 `xuanzeti3`
--

CREATE TABLE IF NOT EXISTS `xuanzeti3` (
  `tihao` int(10) NOT NULL,
  `timu` varchar(500) NOT NULL,
  `daan` varchar(200) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `jiandati`
--
ALTER TABLE `jiandati`
  ADD UNIQUE KEY `tihao` (`tihao`);

--
-- Indexes for table `tiankongti`
--
ALTER TABLE `tiankongti`
  ADD PRIMARY KEY (`tihao`),
  ADD UNIQUE KEY `tihao` (`tihao`),
  ADD KEY `tihao_2` (`tihao`);

--
-- Indexes for table `xuanzeti`
--
ALTER TABLE `xuanzeti`
  ADD PRIMARY KEY (`tihao`),
  ADD UNIQUE KEY `tihao` (`tihao`);

--
-- Indexes for table `xuanzeti2`
--
ALTER TABLE `xuanzeti2`
  ADD PRIMARY KEY (`tihao`);

--
-- Indexes for table `xuanzeti3`
--
ALTER TABLE `xuanzeti3`
  ADD PRIMARY KEY (`tihao`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `jiandati`
--
ALTER TABLE `jiandati`
  MODIFY `tihao` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=19;
--
-- AUTO_INCREMENT for table `tiankongti`
--
ALTER TABLE `tiankongti`
  MODIFY `tihao` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=64;
--
-- AUTO_INCREMENT for table `xuanzeti`
--
ALTER TABLE `xuanzeti`
  MODIFY `tihao` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=43;
--
-- AUTO_INCREMENT for table `xuanzeti2`
--
ALTER TABLE `xuanzeti2`
  MODIFY `tihao` int(10) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `xuanzeti3`
--
ALTER TABLE `xuanzeti3`
  MODIFY `tihao` int(10) NOT NULL AUTO_INCREMENT;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
